#ifndef TASKS
#define TASKS

void runTask1(); // Задание 1: Перевод чаевых из рублей в доллары

void runTask2(); // Задание 2: Сортировка рейсов по длительности

void runTask3(); // Задание 3: Поиск сотрудника старше 50

void runTask4(); // Задание 4: Разделение товаров по цене

void runTask5(); // Задание 5: Сумма заказов

void runTask6(); // Задание 6: Проверка прохождения инструктажа

void runTask7(); // Задание 7: Отбор учеников для олимпиады

void runTask8(); // Задание 8: Удаление отписавшихся пользователей

void runTask9(); // Задание 9: Удаление подряд повторяющихся голосов

void runTask10(); // Задание 10: Инвентаризация склада

#endif
